{
  "displayName": {
    "DataType": "System.String",
    "Name": "Displayname",
    "Section": "Metadata"
  },
  "description": {
    "DataType": "System.String",
    "Name": "Description",
    "Section": "Metadata"
  },
  "priority": {
    "DataType": "System.Int64",
    "Name": "",
    "Section": " "
  },
  "createdDateTime": {
    "DataType": "System.DateTime",
    "Name": "Created at",
    "Section": "Metadata"
  },
  "lastModifiedDateTime": {
    "DataType": "System.DateTime",
    "Name": "Modified at",
    "Section": "Metadata"
  },
  "version": {
    "DataType": "System.Int64",
    "Name": "Version",
    "Section": "Metadata"
  },
  "roleScopeTagIds": {
    "DataType": "System.Object[]",
    "Name": "Role Scopes Tags",
    "Section": "Metadata"
  },
  "deviceEnrollmentConfigurationType": {
    "DataType": "System.String",
    "Name": "",
    "Section": " "
  },
  "state": {
    "DataType": "System.String",
    "Name": "",
    "Section": " "
  }
}
